import React from 'react'
import {assets} from "../assets/assets.js";

const Laboratorna1 = () => {
    return (
        <div>
            <div className="text-base font-light leading-relaxed mt-5">
                <div className="mb-4">
                    <p className="font-semibold text-xl">ПРЕДМЕТНЕ СЕРЕДОВИЩЕ</p>
                </div>
                <p>WEB-застосунок для проходження курсів — <strong>Learnify</strong> – це освітня веб-платформа, аналогічна Udemy або Coursera, 
                    яка дозволяє користувачам проходити онлайн-курси з різних дисциплін. Вона створена для того, щоб зробити навчання доступним, 
                    зручним і інтерактивним.</p>

                <p>Користувачі можуть реєструватися в системі та створювати персональні кабінети, де зберігається історія проходження курсів, 
                    отримані сертифікати та список обраних навчальних програм. Вони мають змогу переглядати каталог курсів, сортувати їх за 
                    категоріями, рейтингом або популярністю, а також додавати обрані курси в особистий список. Проходження навчання включає 
                    відеоуроки, текстові матеріали, практичні завдання та фінальні тести. Після успішного завершення курсу користувач отримує 
                    електронний сертифікат.</p>

                <p>Адміністративна панель забезпечує управління всіма аспектами роботи платформи. Адміністратори можуть створювати та редагувати 
                    навчальні курси, контролювати активність студентів, аналізувати їхню успішність, модерувати відгуки та керувати фінансовою 
                    складовою (вартість курсів, акції, знижки). Також система дозволяє відстежувати статистику проходження курсів та оптимізувати 
                    навчальний процес на основі аналітичних даних.</p>

                <p>Особливу увагу приділено безпеці даних. Усі персональні дані користувачів та адміністрації зберігаються у захищеній базі 
                    даних із використанням сучасних алгоритмів шифрування. Доступ до системи можливий лише після автентифікації та авторизації, 
                    що забезпечує конфіденційність інформації.</p>

                <p>Система підтримує можливість масштабування та оновлення функціоналу, що дозволяє додавати нові модулі, такі як інтеграція 
                    з іншими освітніми платформами, розширені аналітичні інструменти, персоналізовані рекомендації курсів та програма лояльності. 
                    Завдяки використанню сучасних технологій Learnify забезпечує ефективний навчальний процес, покращує користувацький досвід та 
                    сприяє здобуттю нових знань у зручному форматі.</p>

                <div className="mb-4 mt-4">
                    <p className="font-semibold text-xl">БІЗНЕС-ЛОГІКА</p>
                </div>
                <h2 className="text-lg mt-2">Функціональні вимоги</h2>
                <ol>
                    <li>Система реєстрації та авторизації користувачів.</li>
                    <li>Персональний кабінет користувача з історією проходження курсів та сертифікатами.</li>
                    <li>Каталог курсів із можливістю фільтрації та сортування.</li>
                    <li>Інтерактивний пошук курсів за ключовими словами та категоріями.</li>
                    <li>Система оплати курсів (онлайн-оплата та доступ до безкоштовних матеріалів).</li>
                    <li>Модуль керування курсами для адміністратора (створення, редагування, видалення).</li>
                    <li>Система автоматичних сповіщень про оновлення курсів та прогрес навчання.</li>
                </ol>

                <h2 className="text-lg mt-2">Нефункціональні вимоги</h2>
                <ol>
                    <li>Забезпечення високого рівня безпеки персональних даних користувачів.</li>
                    <li>Масштабованість для підтримки великої кількості студентів.</li>
                    <li>Оптимізація продуктивності для швидкого завантаження контенту та відеоуроків.</li>
                    <li>Адаптивний дизайн для коректного відображення на мобільних пристроях.</li>
                    <li>Система резервного копіювання даних та відновлення прогресу.</li>
                    <li>Інтуїтивно зрозумілий та зручний інтерфейс користувача.</li>
                    <li>Можливість інтеграції з іншими освітніми платформами та аналітичними інструментами.</li>
                </ol>
            </div>

            <div className="mb-4 mt-4">
                <p className="font-semibold text-xl">Тема, мета, місце розташування WEB-застосунка та місце
                    звітного HTML-документу</p>
            </div>

            <p>
                Тема: СТРУКТУРА HTML-ДОКУМЕНТА. ВИБІР ПРЕДМЕТНОЇ ГАЛУЗІ. GitHub. РОБОТА З РЕПОЗИТОРІЯМИ. ОСНОВНІ ТЕГИ ТА
                АТРИБУТИ в HTML-ДОКУМЕНТІ.
            </p>

            <p>
                Мета: Придбати практичні навички роботи з GitHub, репозиторіями, HTML-документом, таблицями,
                зображеннями,
                посиланнями, списками, формами. Створити шаблон звітного HTML-документом для відображення
                результатів роботи всіх лабораторних робіт.
            </p>


            <ul>
                <li>
                    Посилання на репозиторій власного WEB-застосунку:<a></a>
                </li>
                <li>
                    Посилання на репозиторій на живу сторінку власного WEB-застосунку:<a></a>
                </li>
                <li>
                    Посилання на репозиторій звітного HTML-документа:<a></a>
                </li>
                <li>
                    Посилання на репозиторій на живу сторінку звітного HTML-документу:<a></a>
                </li>
                <li>
                    Посилання на репозиторій з самостійними роботами:<a></a>
                </li>
                <li>
                    Посилання на репозиторій живу сторінку з самостійними роботами:<a></a>
                </li>
            </ul>
            <div className="mb-4 mt-4">
                <p className="font-semibold text-xl">СТРУКТУРА ДОКУМЕНТА</p>
            </div>

            <p>
                Код для секції курсів:
            </p>
            <img src={assets.courses_section_code} alt="1"/>
            <p>
                Фото:
            </p>
            <img src={assets.courses_section_photo} alt="1"/>
            <p>
                Інформація:
            </p>
            <p>
                <code>
                &lt;&#123;allCourses.slice(0, 4).map((course, index) =&gt; 
                &lt;CourseCard key=&#123;index&#125; course=&#123;course&#125; /&gt;)&#125;
                </code>
                Використовується для відображення карточок курсів, метод <code>&lt;allCourses.slice(0, 4)&gt;</code>  бере тільки 4 перші курси з allCourses.
                <code>&lt;map(...)&gt;</code> – перебирає кожен курс і створює компонент CourseCard для нього. <code>&lt;key=&#123;index&#125;&gt;</code> – унікальний ключ для кожної карточки.
                <code>&lt;course=&#123;course&#125;&gt;</code> – передає дані курсу в компонент CourseCard.
                <br/>
                Тег <code>&lt;ol&gt;</code> (упорядкований список) створює список елементів з чіткою нумерацією або
                іншими маркерами (наприклад, літерами або римськими цифрами). Як і в <code>&lt;ul&gt;</code>, елементи
                списку визначаються тегом <code>&lt;li&gt;</code>.
            
            </p>

            <p>
                Код для списку спонсорів:
            </p>
            <img src={assets.sponsors_code} alt="1"/>
            <p>
                Фото:
            </p>
            <img src={assets.sponsors_photo} alt="1"/>
            <p>
                Інформація:
            </p>
            <p>
                Компонент <code>&lt;Companies&gt;</code> використовується для відображення логотипів компаній, яким довіряють користувачі.
                <code>&lt;p className='text-base text-gray-500'&gt;</code> – тег <code>&lt;p&gt;</code> створює опис підзаголовка, задаючи стиль тексту за допомогою Tailwind CSS.
                <code>&lt;div className='flex flex-wrap items-center justify-center gap-6 md:gap-16 md:mt-10 mt-5'&gt;</code> – 
                контейнер для логотипів, що використовує Flexbox для вирівнювання і адаптивності.
                <code>&lt;img src=&#123;assets.назва_логотипу&#125; alt="Назва компанії" className='w-20 md:w-28'/&gt;</code> – 
                кожен тег <code>&lt;img&gt;</code> додає логотип компанії, задаючи його ширину для різних розмірів екранів.
                <br/>
                Tailwind-класи <code>flex-wrap</code> та <code>justify-center</code> гарантують, що логотипи коректно відображаються навіть на мобільних пристроях.
            </p>

            <p>
                Код для таблиці:
            </p>
            <img src={assets.footer_code} alt="1"/>
            <p>
                Фото:
            </p>
            <img src={assets.footer_photo} alt="1"/>
            <p>
                Інформація:
            </p>
            <p>
            Даний блок є частиною футера сайту та складається з трьох основних секцій.

            <code>&lt;div [FIRST]&gt;</code> – 
            головний контейнер, який використовує <code>flex</code> для адаптивного розміщення елементів у стовпчик на мобільних пристроях і в рядок на більших екранах.

            <code>&lt;div [SECOND]&gt;</code> – 
            перша секція футера, що містить логотип та короткий опис компанії.

            <code>&lt;div [THIRD]&gt;</code> – 
            друга секція футера, що містить заголовок <code>&lt;h2&gt;Company&lt;/h2&gt;</code> 
            та список посилань <code>&lt;ul&gt;</code> для навігації.

            <code>&lt;div [FOURTH]&gt;</code> – 
            третя секція футера, яка містить форму для підписки на розсилку новин.

            <code>&lt;input type="email" placeholder='Enter your email' /&gt;</code> – 
            поле введення для електронної пошти.

            <code>&lt;button&gt;Subscribe&lt;/button&gt;</code> – 
            кнопка для підтвердження підписки.

            Завдяки класам <code>md:flex</code> і <code>hidden</code>, блок з підпискою відображається лише на великих екранах.

            </p>
            <div className="mb-4 mt-4">
                <p className="font-semibold text-xl">ВИСНОВОК</p>
            </div>
            <p>У процесі виконання лабораторної роботи я здобув практичні навички роботи з HTML, GitHub та Figma, які застосував
            для створення Learnify – платформи онлайн-навчання, аналогічної Coursera або Udemy. Я детально вивчив структуру
            HTML-документа, основні теги та їхні атрибути, а також принципи побудови веб-сторінок.

            На початковому етапі я визначив ключову концепцію Learnify, розробив її опис, сформував бізнес-логіку та визначив
            основні функціональні й нефункціональні вимоги. Це допомогло правильно спроєктувати платформу, розподілити її
            функціонал та виділити основні компоненти, такі як:
            <ul>
                <li>Каталог курсів із можливістю пошуку та фільтрації.</li>
                <li>Профілі викладачів і студентів.</li>
                <li>Система управління навчальним контентом.</li>
                <li>Вбудовані тести та сертифікація.</li>
                <li>Інтеграція платіжних сервісів.</li>
            </ul>

                
            </p>
            <p>Після цього я пройшов навчальні уроки у Figma для ознайомлення з інструментом та створив макет
            головної сторінки Learnify. Він включав ключові елементи інтерфейсу: навігаційне меню, блоки
            з популярними курсами, відгуки користувачів та адаптивний дизайн для мобільних пристроїв.
            На початковому етапі я визначив предметну
            </p>
            <p>Після цього я налаштував Git, та з'єднав мій проект з віддаленим репозиторієм, 
            створив живе посилання на веб-застосунок.</p>
            <p>
            Після цього я розпочав розробку HTML-коду головної сторінки Learnify, базуючись на створеному макеті у Figma.
            Головна сторінка містить:
            <ul>
                <li>Заголовки різних рівнів для логічної структуризації контенту.</li>
                <li>Зображення для оформлення сторінки, включаючи логотип платформи та банери курсів.</li>
                <li>Форми для реєстрації користувачів та зворотного зв’язку.</li>
                <li>Посилання на сторінки з описом курсів, викладачів та навчальних програм.</li>
            </ul>
            </p>
            
            <ul>
                <li>заголовки різних рівнів для логічної структуризації інформації;</li>
                <li>зображення для візуального оформлення сторінки;</li>
                <li>таблиці для організації даних;</li>
                <li>списки (нумеровані та марковані) для структурованого відображення інформації;</li>
                <li>форми для отримання інформації від користувачів;</li>
                <li>посилання на сторінку з описом предметної галузі та бізнес-логіки.</li>
            </ul>
            <p>Виконання цієї лабораторної роботи дозволило мені засвоїти основи верстки веб-сторінок,
            навчитися працювати з GitHub, освоїти процес макетування у Figma, а також отримати навички
            організації коду та роботи з репозиторіями. Отримані знання та практичні навички стануть
            важливим фундаментом для подальшого розвитку Learnify та поглибленого вивчення веб-розробки.</p>


        </div>
    )
}

export default Laboratorna1