import React from 'react'
import {assets} from "../assets/assets.js";

const Laboratorna1 = () => {
    return (
        <div>
            <div className="text-base font-light leading-relaxed mt-5">
                <div className="mb-4">
                    <p className="font-semibold text-xl">ПРЕДМЕТНЕ СЕРЕДОВИЩЕ</p>
                </div>
                <p>WEB-застосунок для проходження курсів — <strong>Learnify</strong> – це освітня веб-платформа, аналогічна Udemy або Coursera, 
                    яка дозволяє користувачам проходити онлайн-курси з різних дисциплін. Вона створена для того, щоб зробити навчання доступним, 
                    зручним і інтерактивним.</p>

                <p>Користувачі можуть реєструватися в системі та створювати персональні кабінети, де зберігається історія проходження курсів, 
                    отримані сертифікати та список обраних навчальних програм. Вони мають змогу переглядати каталог курсів, сортувати їх за 
                    категоріями, рейтингом або популярністю, а також додавати обрані курси в особистий список. Проходження навчання включає 
                    відеоуроки, текстові матеріали, практичні завдання та фінальні тести. Після успішного завершення курсу користувач отримує 
                    електронний сертифікат.</p>

                <p>Адміністративна панель забезпечує управління всіма аспектами роботи платформи. Адміністратори можуть створювати та редагувати 
                    навчальні курси, контролювати активність студентів, аналізувати їхню успішність, модерувати відгуки та керувати фінансовою 
                    складовою (вартість курсів, акції, знижки). Також система дозволяє відстежувати статистику проходження курсів та оптимізувати 
                    навчальний процес на основі аналітичних даних.</p>

                <p>Особливу увагу приділено безпеці даних. Усі персональні дані користувачів та адміністрації зберігаються у захищеній базі 
                    даних із використанням сучасних алгоритмів шифрування. Доступ до системи можливий лише після автентифікації та авторизації, 
                    що забезпечує конфіденційність інформації.</p>

                <p>Система підтримує можливість масштабування та оновлення функціоналу, що дозволяє додавати нові модулі, такі як інтеграція 
                    з іншими освітніми платформами, розширені аналітичні інструменти, персоналізовані рекомендації курсів та програма лояльності. 
                    Завдяки використанню сучасних технологій Learnify забезпечує ефективний навчальний процес, покращує користувацький досвід та 
                    сприяє здобуттю нових знань у зручному форматі.</p>

                <div className="mb-4 mt-4">
                    <p className="font-semibold text-xl">БІЗНЕС-ЛОГІКА</p>
                </div>
                <h2 className="text-lg mt-2">Функціональні вимоги</h2>
                <ol>
                    <li>Система реєстрації та авторизації користувачів.</li>
                    <li>Персональний кабінет користувача з історією проходження курсів та сертифікатами.</li>
                    <li>Каталог курсів із можливістю фільтрації та сортування.</li>
                    <li>Інтерактивний пошук курсів за ключовими словами та категоріями.</li>
                    <li>Система оплати курсів (онлайн-оплата та доступ до безкоштовних матеріалів).</li>
                    <li>Модуль керування курсами для адміністратора (створення, редагування, видалення).</li>
                    <li>Система автоматичних сповіщень про оновлення курсів та прогрес навчання.</li>
                </ol>

                <h2 className="text-lg mt-2">Нефункціональні вимоги</h2>
                <ol>
                    <li>Забезпечення високого рівня безпеки персональних даних користувачів.</li>
                    <li>Масштабованість для підтримки великої кількості студентів.</li>
                    <li>Оптимізація продуктивності для швидкого завантаження контенту та відеоуроків.</li>
                    <li>Адаптивний дизайн для коректного відображення на мобільних пристроях.</li>
                    <li>Система резервного копіювання даних та відновлення прогресу.</li>
                    <li>Інтуїтивно зрозумілий та зручний інтерфейс користувача.</li>
                    <li>Можливість інтеграції з іншими освітніми платформами та аналітичними інструментами.</li>
                </ol>
            </div>

            <div className="mb-4 mt-4">
                <p className="font-semibold text-xl">Тема, мета, місце розташування WEB-застосунка та місце
                    звітного HTML-документу</p>
            </div>

            <p>
                Тема: СТРУКТУРА HTML-ДОКУМЕНТА. ВИБІР ПРЕДМЕТНОЇ ГАЛУЗІ. GitHub. РОБОТА З РЕПОЗИТОРІЯМИ. ОСНОВНІ ТЕГИ ТА
                АТРИБУТИ в HTML-ДОКУМЕНТІ.
            </p>

            <p>
                Мета: Придбати практичні навички роботи з GitHub, репозиторіями, HTML-документом, таблицями,
                зображеннями, посиланнями, списками, формами. Створити шаблон звітного HTML-документом для відображення
                результатів роботи всіх лабораторних робіт.
            </p>


            <ul>
                <li>
                
                Посилання на репозиторій власного WEB-застосунку:  
                <a href="https://github.com/lesflq/IO-24_appWEB-MaksymSevastianov-FIOT-2025/tree/lab-1-web-architecture" 
                 target="_blank"> Переглянути репозиторій</a>

                </li>
                <li> Посилання на репозиторій на живу сторінку власного WEB-застосунку:
                <a href="https://lesflq.github.io/IO-24_appWEB-MaksymSevastianov-FIOT-2025/" 
                 target="_blank"> Переглянути сторінку</a>
                </li>
                <li>
                    Посилання на репозиторій звітного HTML-документа:<a href='https://github.com/lesflq/IO-24_appRECORD-MaksymSevastianov-FIOT-2025' target="_blank"> Переглянути репозиторій</a>
                </li>
                <li>
                    Посилання на репозиторій на живу сторінку звітного HTML-документу:<a href="https://lesflq.github.io/IO-24_appRECORD-MaksymSevastianov-FIOT-2025/" 
                 target="_blank"> Переглянути сторінку</a>
                </li>
                <li>
                    Посилання на репозиторій з самостійними роботами:<a href="https://github.com/lesflq/IO-24_INDEPENDENT-MaksymSevastianov-FIOT-2025" 
                 target="_blank">Переглянути репозиторій</a>
                </li>
                <li>
                    Посилання на репозиторій живу сторінку з самостійними роботами:<a></a>
                </li>
            </ul>
            <div className="mb-4 mt-4">
                <p className="font-semibold text-xl">СТРУКТУРА ДОКУМЕНТА</p>
            </div>

            <p>
                Код для таблиці:
            </p>
            <img src={assets.table_code} alt="1"/>
            <p>
                Фото:
            </p>
            <img src={assets.table_photo} alt="1"/>
            <p>
                Інформація:
            </p>
            <p>
            Надана таблиця побудована за допомогою HTML та стилізована за допомогою Tailwind CSS. Нижче наведено пояснення ключових елементів, використаних у таблиці.
            </p>

            <ul>
            <li>
                <code>&lt;table&gt;</code> – Визначає основну структуру таблиці.
            </li>
            <li>
                <code>&lt;thead&gt;</code> – Містить заголовки таблиці, що описують стовпці.
            </li>
            <li>
                <code>&lt;tbody&gt;</code> – Містить основний вміст таблиці.
            </li>
            <li>
                <code>&lt;tr&gt;</code> – Визначає рядок таблиці.
            </li>
            <li>
                <code>&lt;th&gt;</code> – Вказує на заголовкову комірку, яка за замовчуванням має жирний текст.
            </li>
            <li>
                <code>&lt;td&gt;</code> – Визначає стандартну комірку з даними.
            </li>
            </ul>

            <p>
            Для покращення вигляду таблиці використовуються класи Tailwind CSS
            </p>

            <p>
            Ця таблиця є повністю адаптивною та має привабливий вигляд, що забезпечує зручний користувацький досвід на різних пристроях.
            </p>



            <p>
                Код для зображення:
            </p>
            <img src={assets.sponsors_code} alt="1"/>
            <p>
                Фото:
            </p>
            <img src={assets.sponsors_photo} alt="1"/>
            <p>
                Інформація:
            </p>
            <p>
            У наведеному коді використовується тег <code>&lt;img&gt;</code> для відображення логотипів компаній. Нижче розглянемо основні атрибути цього тегу.
            </p>

            <ul>
            <li>
                <code>&lt;img src="..."&gt;</code> – Визначає шлях до зображення. У даному випадку, зображення отримуються з об’єкта <code>assets</code>.
            </li>
            <li>
                <code>&lt;img alt="..."&gt;</code> – Атрибут <code>alt</code> містить текстовий опис зображення, що використовується для доступності та у разі, якщо зображення не завантажилося.
            </li>
            <li>
                <code>&lt;img class="..."&gt;</code> – У коді застосовуються класи Tailwind CSS для стилізації:
            </li>
            </ul>

            <p>
            Завдяки додатковим стилям зображення адаптуються під різні пристрої, зберігаючи гармонійний вигляд.
            </p>


            <p>
                Код для списку:
            </p>
            <img src={assets.footer_code} alt="1"/>
            <p>
                Фото:
            </p>
            <img src={assets.footer_photo} alt="1"/>
            <p>
                Інформація:
            </p>
            <p>
            У цьому коді використовується тег <code>&lt;ul&gt;</code> для створення списку посилань. Нижче розглянемо основні теги та атрибути, які використовуються для створення списків.
            </p>

            <h3>Основні теги списків:</h3>

            <ul>
            <li>
                <code>&lt;ul&gt;</code> – Означає ненумерований (маркерний) список. У даному випадку він використовується для відображення навігаційних посилань.
            </li>
            <li>
                <code>&lt;li&gt;</code> – Визначає окремий пункт списку.
            </li>
            <li>
                <code>&lt;a href="..."&gt;</code> – Створює гіперпосилання у кожному пункті списку.
            </li>
            </ul>

            <p>
            Завдяки стилям Tailwind CSS списки виглядають естетично та адаптуються до різних розмірів екрана.
            </p>

            <div className="mb-4 mt-4">
                <p className="font-semibold text-xl">ВИСНОВОК</p>
            </div>
            <p>У процесі виконання лабораторної роботи я здобув практичні навички роботи з HTML, GitHub та Figma, які застосував
            для створення Learnify – платформи онлайн-навчання, аналогічної Coursera або Udemy. Я детально вивчив структуру
            HTML-документа, основні теги та їхні атрибути, а також принципи побудови веб-сторінок.

            На початковому етапі я визначив ключову концепцію Learnify, розробив її опис, сформував бізнес-логіку та визначив
            основні функціональні й нефункціональні вимоги. Це допомогло правильно спроєктувати платформу, розподілити її
            функціонал та виділити основні компоненти, такі як:
            <ul>
                <li>Каталог курсів із можливістю пошуку та фільтрації.</li>
                <li>Профілі викладачів і студентів.</li>
                <li>Система управління навчальним контентом.</li>
                <li>Вбудовані тести та сертифікація.</li>
                <li>Інтеграція платіжних сервісів.</li>
            </ul>

                
            </p>
            <p>Після цього я пройшов навчальні уроки у Figma для ознайомлення з інструментом та створив макет
            головної сторінки Learnify. Він включав ключові елементи інтерфейсу: навігаційне меню, блоки
            з популярними курсами, відгуки користувачів та адаптивний дизайн для мобільних пристроїв.
            На початковому етапі я визначив предметну
            </p>
            <p>Після цього я налаштував Git, та з'єднав мій проект з віддаленим репозиторієм, 
            створив живе посилання на веб-застосунок.</p>
            <p>
            Після цього я розпочав розробку HTML-коду головної сторінки Learnify, базуючись на створеному макеті у Figma.
            Головна сторінка містить:
            <ul>
                <li>Заголовки різних рівнів для логічної структуризації контенту.</li>
                <li>Зображення для оформлення сторінки, включаючи логотип платформи та банери курсів.</li>
                <li>Форми для реєстрації користувачів та зворотного зв’язку.</li>
                <li>Посилання на сторінки з описом курсів, викладачів та навчальних програм.</li>
            </ul>
            </p>
            
            <ul>
                <li>заголовки різних рівнів для логічної структуризації інформації;</li>
                <li>зображення для візуального оформлення сторінки;</li>
                <li>таблиці для організації даних;</li>
                <li>списки (нумеровані та марковані) для структурованого відображення інформації;</li>
                <li>форми для отримання інформації від користувачів;</li>
                <li>посилання на сторінку з описом предметної галузі та бізнес-логіки.</li>
            </ul>
            <p>Виконання цієї лабораторної роботи дозволило мені засвоїти основи верстки веб-сторінок,
            навчитися працювати з GitHub, освоїти процес макетування у Figma, а також отримати навички
            організації коду та роботи з репозиторіями. Отримані знання та практичні навички стануть
            важливим фундаментом для подальшого розвитку Learnify та поглибленого вивчення веб-розробки.</p>


        </div>
    )
}

export default Laboratorna1